In [13]:
import pandas as pd
import datetime as dt

In [14]:
file = "mortgage_rates.csv"
df=pd.read_csv(file,parse_dates=True)
df.head()

      Date  Mortgage Rate  Interest Rate
0  1951-01           5.00            0.0
1  1951-02           5.00            0.0
2  1951-03           5.00            0.0
3  1951-04           5.25            0.0
4  1951-05           5.50            0.0

In [15]:
df2 = df.drop(['Interest Rate'],axis=1)

In [16]:
df2

        Date  Mortgage Rate
0    1951-01           5.00
1    1951-02           5.00
2    1951-03           5.00
3    1951-04           5.25
4    1951-05           5.50
..       ...            ...
852  2022-01           3.44
853  2022-02           3.58
854  2022-03           3.77
855  2022-04           4.19
856  2022-05           4.63

[857 rows x 2 columns]

In [17]:

df2["Date"] = pd.to_datetime(df2["Date"])
df2.dtypes

Date             datetime64[ns]
Mortgage Rate           float64
dtype: object

In [18]:
df2.isnull().sum()

Date             0
Mortgage Rate    0
dtype: int64

In [19]:
df2.describe()

       Mortgage Rate
count     857.000000
mean        8.096301
std         3.306675
min         3.200000
25%         5.870000
50%         7.000000
75%        10.330000
max        21.460000